var word='的一是在不了有和人這中大為上個國我\
以要他時來用們生到作地於出就分對成會可主發年動\
同工也能下過子說產種面而方後多定行學法所民得經\
十三之進著等部度家電力裏如水化高自二理起小物現\
實加量都兩體制機當使點從業本去把性好應開它合還\
因由其些然前外天政四日那社義事平形相全表間樣與\
關各重新線內數正心反你明看原又麼利比或但質氣第\
向道命此變條只沒結解問意建月公無系軍很情者最立\
代想已通並提直題党程展五果料象員革位入常文總次\
品式活設及管特件長求老頭基資邊流路級少圖山統接\
知較將組見計別她手角期根論運農指幾九區強放決西\
被幹做必戰先回則任取據處隊南給色光門即保治北造\
百規熱領七海口東導器壓志世金增爭濟階油思術極交\
受聯什認六共權收證改清己美再采轉更單風切打白教\
速花帶安場身車例真務具萬每目至達走積示議聲報鬥\
完類八離華名確才科張信馬節話米整空元況今集溫傳\
土許步群廣石記需段研界拉林律叫且究觀越織裝影算\
低持音眾書布複容兒須際商非驗連斷深難近礦千周委\
素技備半辦青省列習響約支般史感勞便團往酸曆市克\
何除消構府稱太准精值號率族維劃選標寫存候毛親快\
效斯院查江型眼王按格養易置派層片始卻專狀育廠京\
識適屬圓包火住調滿縣局照參紅細引聽該鐵價嚴'
var letters = []
for(var i=0; i < word.length; i++){
	letters.push(word[i])
}

module.exports = {
	genurl: function(){
		var url = "";
		for(var i=0; i<4; i++){
			var letter = letters[Math.floor(Math.random()*letters.length)];
			url = url + letter;
		}
		return url;
	}
}
